redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_gpio.h
/***********************************************************************************************************************
    @file     reg_gpio.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_GPIO_H
#define __REG_GPIO_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief GPIO Base Address Definition
  */
#define GPIOA_BASE                      (AHBPERIPH_BASE + 0x7FE0000)            /*!< Base Address: 0x48000000 */
#define GPIOB_BASE                      (AHBPERIPH_BASE + 0x7FE0400)            /*!< Base Address: 0x48000400 */

/**
  * @brief GPIO Registers Structure Definition
  */
typedef struct {
    __IO uint32_t CRL;                                                               /*!< Control Register Low,                          offset: 0x00 */
    __IO uint32_t CRH;                                                               /*!< Control Register High,                         offset: 0x04 */
    __IO uint32_t IDR;                                                               /*!< Input Data Register,                           offset: 0x08 */
    __IO uint32_t ODR;                                                               /*!< Output Data Register,                          offset: 0x0C */
    __IO uint32_t BSRR;                                                              /*!< Bit Set or Reset Register,                     offset: 0x10 */
    __IO uint32_t BRR;                                                               /*!< Bit Reset Register,                            offset: 0x14 */
    __IO uint32_t LCKR;                                                              /*!< Lock Register,                                 offset: 0x18 */
    __IO uint32_t DCR;                                                               /*!< Pin Output Open Drain Config Register,         offset: 0x1C */
    __IO uint32_t AFRL;                                                              /*!< Port Multiplexing Function Low Register,       offset: 0x20 */
    __IO uint32_t AFRH;                                                              /*!< Port Multiplexing Function High Register,      offset: 0x24 */
} GPIO_TypeDef;

/**
  * @brief GPIO type pointer Definition
  */
#define GPIOA                           ((GPIO_TypeDef*) GPIOA_BASE)
#define GPIOB                           ((GPIO_TypeDef*) GPIOB_BASE)

/**
  * @brief GPIO Common Register Bit Definition
  */
#define GPIO_CNF_MODE_AIN               0x00UL /*!<0b0000,*/                        /*!< Analog input */
#define GPIO_CNF_MODE_FLOATING          0x04UL /*!<0b0100,*/                        /*!< Floating input */
#define GPIO_CNF_MODE_INPUPD            0x08UL /*!<0b1000,*/                        /*!< Pull up and down input */
#define GPIO_CNF_MODE_INRESEVED         0x0CUL /*!<0b1100,*/                        /*!< Reseved input mode */
#define GPIO_CNF_MODE_OUT_PP            0x01UL /*!<0b0001,*/                        /*!< Universal push-pull  output default */
#define GPIO_CNF_MODE_OUT_OD            0x05UL /*!<0b0101,*/                        /*!< Universal open drain output default */
#define GPIO_CNF_MODE_AF_PP             0x09UL /*!<0b1001,*/                        /*!< Multiplex push-pull  output default */
#define GPIO_CNF_MODE_AF_OD             0x0DUL /*!<0b1101 */                        /*!< Multiplex open drain output default */
#define GPIO_CNF_MODE_50MHZ_OUT_PP      0x01UL /*!<0b0001,*/                        /*!< Universal push-pull  output 50MHZ */
#define GPIO_CNF_MODE_50MHZ_OUT_OD      0x05UL /*!<0b0101,*/                        /*!< Universal open drain output 50MHZ */
#define GPIO_CNF_MODE_50MHZ_AF_PP       0x09UL /*!<0b1001,*/                        /*!< Multiplex push-pull  output 50MHZ */
#define GPIO_CNF_MODE_50MHZ_AF_OD       0x0DUL /*!<0b1101 */                        /*!< Multiplex open drain output 50MHZ */
#define GPIO_CNF_MODE_20MHZ_OUT_PP      0x02UL /*!<0b0010,*/                        /*!< Universal push-pull  output 20MHZ */
#define GPIO_CNF_MODE_20MHZ_OUT_OD      0x06UL /*!<0b0110,*/                        /*!< Universal open drain output 20MHZ */
#define GPIO_CNF_MODE_20MHZ_AF_PP       0x0AUL /*!<0b1010,*/                        /*!< Multiplex push-pull  output 20MHZ */
#define GPIO_CNF_MODE_20MHZ_AF_OD       0x0EUL /*!<0b1110 */                        /*!< Multiplex open drain output 20MHZ */
#define GPIO_CNF_MODE_10MHZ_OUT_PP      0x03UL /*!<0b0011,*/                        /*!< Universal push-pull  output 10MHZ */
#define GPIO_CNF_MODE_10MHZ_OUT_OD      0x07UL /*!<0b0111,*/                        /*!< Universal open drain output 10MHZ */
#define GPIO_CNF_MODE_10MHZ_AF_PP       0x0BUL /*!<0b1011,*/                        /*!< Multiplex push-pull  output 10MHZ */
#define GPIO_CNF_MODE_10MHZ_AF_OD       0x0FUL /*!<0b1111 */                        /*!< Multiplex open drain output 10MHZ */
#define GPIO_CNF_MODE_MASK              0x0FUL /*!<0b1111 */

#define GPIO_CRL_CNF_MODE_0_Pos         (0)
#define GPIO_CRL_CNF_MODE_1_Pos         (4)
#define GPIO_CRL_CNF_MODE_2_Pos         (8)
#define GPIO_CRL_CNF_MODE_3_Pos         (12)
#define GPIO_CRL_CNF_MODE_4_Pos         (16)
#define GPIO_CRL_CNF_MODE_5_Pos         (20)
#define GPIO_CRL_CNF_MODE_6_Pos         (24)
#define GPIO_CRL_CNF_MODE_7_Pos         (28)
#define GPIO_CRH_CNF_MODE_8_Pos         (0)
#define GPIO_CRH_CNF_MODE_9_Pos         (4)
#define GPIO_CRH_CNF_MODE_10_Pos        (8)
#define GPIO_CRH_CNF_MODE_11_Pos        (12)
#define GPIO_CRH_CNF_MODE_12_Pos        (16)
#define GPIO_CRH_CNF_MODE_13_Pos        (20)
#define GPIO_CRH_CNF_MODE_14_Pos        (24)
#define GPIO_CRH_CNF_MODE_15_Pos        (28)

/**
  * @brief GPIO_CRL Register Bit Definition
  */
#define GPIO_CRL_MODE                   ((uint32_t)0x33333333)                       /*!< Port x mode bits */

#define GPIO_CRL_MODE0_Pos              (0)
#define GPIO_CRL_MODE0                  (0x03U << GPIO_CRL_MODE0_Pos)           /*!< MODE0[1:0] bits (portx mode bits, pin 0) */
#define GPIO_CRL_MODE0_0                (0x01U << GPIO_CRL_MODE0_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE0_1                (0x02U << GPIO_CRL_MODE0_Pos)           /*!< Bit 1 */

