redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_gpio.h
/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define GPIO_BRR_BR0_Pos                (0)
#define GPIO_BRR_BR0                    (0x01U << GPIO_BRR_BR0_Pos)             /*!< Portx Set bit 0 */
#define GPIO_BRR_BR1_Pos                (1)
#define GPIO_BRR_BR1                    (0x01U << GPIO_BRR_BR1_Pos)             /*!< Portx Set bit 1 */
#define GPIO_BRR_BR2_Pos                (2)
#define GPIO_BRR_BR2                    (0x01U << GPIO_BRR_BR2_Pos)             /*!< Portx Set bit 2 */
#define GPIO_BRR_BR3_Pos                (3)
#define GPIO_BRR_BR3                    (0x01U << GPIO_BRR_BR3_Pos)             /*!< Portx Set bit 3 */
#define GPIO_BRR_BR4_Pos                (4)
#define GPIO_BRR_BR4                    (0x01U << GPIO_BRR_BR4_Pos)             /*!< Portx Set bit 4 */
#define GPIO_BRR_BR5_Pos                (5)
#define GPIO_BRR_BR5                    (0x01U << GPIO_BRR_BR5_Pos)             /*!< Portx Set bit 5 */
#define GPIO_BRR_BR6_Pos                (6)
#define GPIO_BRR_BR6                    (0x01U << GPIO_BRR_BR6_Pos)             /*!< Portx Set bit 6 */
#define GPIO_BRR_BR7_Pos                (7)
#define GPIO_BRR_BR7                    (0x01U << GPIO_BRR_BR7_Pos)             /*!< Portx Set bit 7 */
#define GPIO_BRR_BR8_Pos                (8)
#define GPIO_BRR_BR8                    (0x01U << GPIO_BRR_BR8_Pos)             /*!< Portx Set bit 8 */
#define GPIO_BRR_BR9_Pos                (9)
#define GPIO_BRR_BR9                    (0x01U << GPIO_BRR_BR9_Pos)             /*!< Portx Set bit 9 */
#define GPIO_BRR_BR10_Pos               (10)
#define GPIO_BRR_BR10                   (0x01U << GPIO_BRR_BR10_Pos)            /*!< Portx Set bit 10 */
#define GPIO_BRR_BR11_Pos               (11)
#define GPIO_BRR_BR11                   (0x01U << GPIO_BRR_BR11_Pos)            /*!< Portx Set bit 11 */
#define GPIO_BRR_BR12_Pos               (12)
#define GPIO_BRR_BR12                   (0x01U << GPIO_BRR_BR12_Pos)            /*!< Portx Set bit 12 */
#define GPIO_BRR_BR13_Pos               (13)
#define GPIO_BRR_BR13                   (0x01U << GPIO_BRR_BR13_Pos)            /*!< Portx Set bit 13 */
#define GPIO_BRR_BR14_Pos               (14)
#define GPIO_BRR_BR14                   (0x01U << GPIO_BRR_BR14_Pos)            /*!< Portx Set bit 14 */
#define GPIO_BRR_BR15_Pos               (15)
#define GPIO_BRR_BR15                   (0x01U << GPIO_BRR_BR15_Pos)            /*!< Portx Set bit 15 */

/**
  * @brief GPIO_LCKR Register Bit Definition
  */
#define GPIO_LCKR_LCK_Pos               (0)
#define GPIO_LCKR_LCK                   (0xFFFFU << GPIO_LCKR_LCK_Pos)          /*!< Portx Lock */
#define GPIO_LCKR_LCKK_Pos              (16)
#define GPIO_LCKR_LCKK                  (0x01U << GPIO_LCKR_LCKK_Pos)           /*!< Lock key */

/**
  * @brief GPIO_LCKR Register Bit Definition
  */
#define GPIO_LCKR_LCK0_Pos              (0)
#define GPIO_LCKR_LCK0                  (0x01U << GPIO_LCKR_LCK0_Pos)           /*!< Portx Set bit 0 */
#define GPIO_LCKR_LCK1_Pos              (1)
#define GPIO_LCKR_LCK1                  (0x01U << GPIO_LCKR_LCK1_Pos)           /*!< Portx Set bit 1 */
#define GPIO_LCKR_LCK2_Pos              (2)
#define GPIO_LCKR_LCK2                  (0x01U << GPIO_LCKR_LCK2_Pos)           /*!< Portx Set bit 2 */
#define GPIO_LCKR_LCK3_Pos              (3)
#define GPIO_LCKR_LCK3                  (0x01U << GPIO_LCKR_LCK3_Pos)           /*!< Portx Set bit 3 */
#define GPIO_LCKR_LCK4_Pos              (4)
#define GPIO_LCKR_LCK4                  (0x01U << GPIO_LCKR_LCK4_Pos)           /*!< Portx Set bit 4 */
#define GPIO_LCKR_LCK5_Pos              (5)
#define GPIO_LCKR_LCK5                  (0x01U << GPIO_LCKR_LCK5_Pos)           /*!< Portx Set bit 5 */
#define GPIO_LCKR_LCK6_Pos              (6)
#define GPIO_LCKR_LCK6                  (0x01U << GPIO_LCKR_LCK6_Pos)           /*!< Portx Set bit 6 */
#define GPIO_LCKR_LCK7_Pos              (7)
#define GPIO_LCKR_LCK7                  (0x01U << GPIO_LCKR_LCK7_Pos)           /*!< Portx Set bit 7 */
#define GPIO_LCKR_LCK8_Pos              (8)
#define GPIO_LCKR_LCK8                  (0x01U << GPIO_LCKR_LCK8_Pos)           /*!< Portx Set bit 8 */
#define GPIO_LCKR_LCK9_Pos              (9)
#define GPIO_LCKR_LCK9                  (0x01U << GPIO_LCKR_LCK9_Pos)           /*!< Portx Set bit 9 */
#define GPIO_LCKR_LCK10_Pos             (10)
#define GPIO_LCKR_LCK10                 (0x01U << GPIO_LCKR_LCK10_Pos)          /*!< Portx Set bit 10 */
#define GPIO_LCKR_LCK11_Pos             (11)
#define GPIO_LCKR_LCK11                 (0x01U << GPIO_LCKR_LCK11_Pos)          /*!< Portx Set bit 11 */
#define GPIO_LCKR_LCK12_Pos             (12)
#define GPIO_LCKR_LCK12                 (0x01U << GPIO_LCKR_LCK12_Pos)          /*!< Portx Set bit 12 */
#define GPIO_LCKR_LCK13_Pos             (13)
#define GPIO_LCKR_LCK13                 (0x01U << GPIO_LCKR_LCK13_Pos)          /*!< Portx Set bit 13 */
#define GPIO_LCKR_LCK14_Pos             (14)
#define GPIO_LCKR_LCK14                 (0x01U << GPIO_LCKR_LCK14_Pos)          /*!< Portx Set bit 14 */
#define GPIO_LCKR_LCK15_Pos             (15)
#define GPIO_LCKR_LCK15                 (0x01U << GPIO_LCKR_LCK15_Pos)          /*!< Portx Set bit 15 */

/**
  * @brief GPIO_DCR Register Bit Definition
  */
#define GPIO_DCR_PX0_Pos                (0)
#define GPIO_DCR_PX0                    (0x03U << GPIO_DCR_PX0_Pos)             /*!< PX0[1:0] bits (pinx configuration bits, pin 0) */
#define GPIO_DCR_PX0_MODE0              (0x00U << GPIO_DCR_PX0_Pos)             /*!< Mode = 0 */
#define GPIO_DCR_PX0_MODE1              (0x01U << GPIO_DCR_PX0_Pos)             /*!< Mode = 1 */
#define GPIO_DCR_PX0_MODE2              (0x02U << GPIO_DCR_PX0_Pos)             /*!< Mode = 2 */
#define GPIO_DCR_PX0_MODE3              (0x03U << GPIO_DCR_PX0_Pos)             /*!< Mode = 3 */
#define GPIO_DCR_PX1_Pos                (2)
#define GPIO_DCR_PX1                    (0x03U << GPIO_DCR_PX1_Pos)             /*!< PX1[1:0] bits (pinx configuration bits, pin 1) */
#define GPIO_DCR_PX1_MODE0              (0x00U << GPIO_DCR_PX1_Pos)             /*!< Mode = 0 */
#define GPIO_DCR_PX1_MODE1              (0x01U << GPIO_DCR_PX1_Pos)             /*!< Mode = 1 */
#define GPIO_DCR_PX1_MODE2              (0x02U << GPIO_DCR_PX1_Pos)             /*!< Mode = 2 */
#define GPIO_DCR_PX1_MODE3              (0x03U << GPIO_DCR_PX1_Pos)             /*!< Mode = 3 */
#define GPIO_DCR_PX2_Pos                (4)
#define GPIO_DCR_PX2                    (0x03U << GPIO_DCR_PX2_Pos)             /*!< PX2[1:0] bits (pinx configuration bits, pin 2) */
#define GPIO_DCR_PX2_MODE0              (0x00U << GPIO_DCR_PX2_Pos)             /*!< Mode = 0 */
#define GPIO_DCR_PX2_MODE1              (0x01U << GPIO_DCR_PX2_Pos)             /*!< Mode = 1 */
#define GPIO_DCR_PX2_MODE2              (0x02U << GPIO_DCR_PX2_Pos)             /*!< Mode = 2 */
#define GPIO_DCR_PX2_MODE3              (0x03U << GPIO_DCR_PX2_Pos)             /*!< Mode = 3 */
#define GPIO_DCR_PX3_Pos                (6)
#define GPIO_DCR_PX3                    (0x03U << GPIO_DCR_PX3_Pos)             /*!< PX3[1:0] bits (pinx configuration bits, pin 3) */
#define GPIO_DCR_PX3_MODE0              (0x00U << GPIO_DCR_PX3_Pos)             /*!< Mode = 0 */
#define GPIO_DCR_PX3_MODE1              (0x01U << GPIO_DCR_PX3_Pos)             /*!< Mode = 1 */
#define GPIO_DCR_PX3_MODE2              (0x02U << GPIO_DCR_PX3_Pos)             /*!< Mode = 2 */
#define GPIO_DCR_PX3_MODE3              (0x03U << GPIO_DCR_PX3_Pos)             /*!< Mode = 3 */

#define GPIO_DCR_PX4_Pos                (8)
#define GPIO_DCR_PX4                    (0x03U << GPIO_DCR_PX4_Pos)             /*!< PX4[1:0] bits (pinx configuration bits, pin 4) */
#define GPIO_DCR_PX4_MODE0              (0x00U << GPIO_DCR_PX4_Pos)             /*!< Mode = 0 */
#define GPIO_DCR_PX4_MODE1              (0x01U << GPIO_DCR_PX4_Pos)             /*!< Mode = 1 */
#define GPIO_DCR_PX4_MODE2              (0x02U << GPIO_DCR_PX4_Pos)             /*!< Mode = 2 */
#define GPIO_DCR_PX4_MODE3              (0x03U << GPIO_DCR_PX4_Pos)             /*!< Mode = 3 */

