redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_gpio.h
#define GPIO_ModuleN                    (0x0FU)
#define GPIO_ModuleA                    (0x00U)
#define GPIO_ModuleB                    (0x01U)

#define GPIO_PinNo0                     (0x00U)
#define GPIO_PinNo1                     (0x01U)
#define GPIO_PinNo2                     (0x02U)
#define GPIO_PinNo3                     (0x03U)
#define GPIO_PinNo4                     (0x04U)
#define GPIO_PinNo5                     (0x05U)
#define GPIO_PinNo6                     (0x06U)
#define GPIO_PinNo7                     (0x07U)
#define GPIO_PinNo8                     (0x08U)
#define GPIO_PinNo9                     (0x09U)
#define GPIO_PinNo10                    (0x0AU)
#define GPIO_PinNo11                    (0x0BU)
#define GPIO_PinNo12                    (0x0CU)
#define GPIO_PinNo13                    (0x0DU)
#define GPIO_PinNo14                    (0x0EU)
#define GPIO_PinNo15                    (0x0FU)

typedef enum {
    PinConfigADC1IN0_PB1                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo1  << 4) + (GPIO_ModuleB << 0),                     /*!< ADC1IN0_PB1 */
    PinConfigADC1IN0                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo1  << 4) + (GPIO_ModuleB << 0),                     /*!< ADC1IN0_PB1 */
    PinConfigADC1IN1_PB0                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleB << 0),                     /*!< ADC1IN1_PB0 */
    PinConfigADC1IN1                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleB << 0),                     /*!< ADC1IN1_PB0 */
    PinConfigADC1IN2_PA3                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo3  << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN2_PA3 */
    PinConfigADC1IN2                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo3  << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN2_PA3 */
    PinConfigADC1IN3_PA12               = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo12 << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN3_PA12 */
    PinConfigADC1IN3                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo12 << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN3_PA12 */
    PinConfigADC1IN4_PA11               = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo11 << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN4_PA11 */
    PinConfigADC1IN4                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo11 << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN4_PA11 */
    PinConfigADC1IN5_PA2                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo2  << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN5_PA2 */
    PinConfigADC1IN5                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo2  << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN5_PA2 */
    PinConfigADC1IN6_PA15               = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo15 << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN6_PA15 */
    PinConfigADC1IN6                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo15 << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN6_PA15 */
    PinConfigADC1IN7_PA7                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN7_PA7 */
    PinConfigADC1IN7                    = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AIN           << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< ADC1IN7_PA7 */
} PinConfigADC;

typedef enum {
    PinConfigDEBUG_SWCLK_PA14           = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo14 << 4) + (GPIO_ModuleA << 0),                     /*!< SWDCLK_PA14 */
    PinConfigDEBUG_SWCLK                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo14 << 4) + (GPIO_ModuleA << 0),                     /*!< SWDCLK_PA14 */
    PinConfigDEBUG_SWDIO_PA13           = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo13 << 4) + (GPIO_ModuleA << 0),                     /*!< SWDIO_PA13 */
    PinConfigDEBUG_SWDIO                = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo13 << 4) + (GPIO_ModuleA << 0),                     /*!< SWDIO_PA13 */
} PinConfigDEBUG;

typedef enum {
    PinConfigI2C1_SCL_PA0               = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SCL_PA0 */
    PinConfigI2C1_SCL                   = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SCL_PA0 */
    PinConfigI2C1_SCL_PA5               = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo5  << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SCL_PA5 */
    PinConfigI2C1_SCL_PA13              = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo13 << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SCL_PA13 */
    PinConfigI2C1_SDA_PA1               = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo1  << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SDA_PA1 */
    PinConfigI2C1_SDA                   = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo1  << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SDA_PA1 */
    PinConfigI2C1_SDA_PA4               = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_OD         << 8) + (GPIO_PinNo4  << 4) + (GPIO_ModuleA << 0),                     /*!< I2C1_SDA_PA4 */
} PinConfigI2C;

