redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_gpio.h
typedef enum {
    PinConfigMCO_OUT_PA7                = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< MCO_PA7 */
    PinConfigMCO_OUT                    = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< MCO_PA7 */
} PinConfigMCO;

typedef enum {
    PinConfigSPI1_MISO_PA7              = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_MISO_PA7 */
    PinConfigSPI1_MISO                  = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_MISO_PA7 */
    PinConfigSPI1_MISO_PA10             = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo10 << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_MISO_PA10 */
    PinConfigSPI1_MOSI_PA6              = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_MOSI_PA6 */
    PinConfigSPI1_MOSI                  = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_MOSI_PA6 */
    PinConfigSPI1_MOSI_PA9              = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo9  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_MOSI_PA9 */
    PinConfigSPI1_NSS_PA0               = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_NSS_PA0 */
    PinConfigSPI1_NSS                   = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_NSS_PA0 */
    PinConfigSPI1_NSS_PA15              = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo15 << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_NSS_PA15 */
    PinConfigSPI1_SCK_PA5               = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo5  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_SCK_PA5 */
    PinConfigSPI1_SCK                   = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo5  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_SCK_PA5 */
    PinConfigSPI1_SCK_PA8               = (GPIO_AF_MODE0  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo8  << 4) + (GPIO_ModuleA << 0),                     /*!< SPI1_SCK_PA8 */
} PinConfigSPI;

typedef enum {
    PinConfigTIM1_BKIN_PA4              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo4  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_BKIN_PA4 */
    PinConfigTIM1_BKIN                  = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo4  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_BKIN_PA4 */
    PinConfigTIM1_CH1_PA6               = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH1_PA6 */
    PinConfigTIM1_CH1                   = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH1_PA6 */
    PinConfigTIM1_CH1_PA9               = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo9  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH1_PA9 */
    PinConfigTIM1_CH1N_PA6              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH1N_PA6 */
    PinConfigTIM1_CH1N                  = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH1N_PA6 */
    PinConfigTIM1_CH1N_PA7              = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH1N_PA7 */
    PinConfigTIM1_CH2_PA8               = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo8  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2_PA8 */
    PinConfigTIM1_CH2                   = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo8  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2_PA8 */
    PinConfigTIM1_CH2_PA10              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo10 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2_PA10 */
    PinConfigTIM1_CH2_PA11              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo11 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2_PA11 */
    PinConfigTIM1_CH2N_PA2              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo2  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2N_PA2 */
    PinConfigTIM1_CH2N                  = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo2  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2N_PA2 */
    PinConfigTIM1_CH2N_PA7              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2N_PA7 */
    PinConfigTIM1_CH2N_PA9              = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo9  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH2N_PA9 */
    PinConfigTIM1_CH3_PA6               = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH3_PA6 */
    PinConfigTIM1_CH3                   = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo6  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH3_PA6 */
    PinConfigTIM1_CH3_PA10              = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo10 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH3_PA10 */
    PinConfigTIM1_CH3N_PA0              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH3N_PA0 */
    PinConfigTIM1_CH3N                  = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH3N_PA0 */
    PinConfigTIM1_CH3N_PA15             = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo15 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH3N_PA15 */
    PinConfigTIM1_CH4_PA7               = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH4_PA7 */
    PinConfigTIM1_CH4                   = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo7  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM1_CH4_PA7 */
    PinConfigTIM3_CH1_PA8               = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo8  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH1_PA8 */
    PinConfigTIM3_CH1                   = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo8  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH1_PA8 */
    PinConfigTIM3_CH1_PA11              = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo11 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH1_PA11 */
    PinConfigTIM3_CH2_PA2               = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo2  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH2_PA2 */
    PinConfigTIM3_CH2                   = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo2  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH2_PA2 */
    PinConfigTIM3_CH3_PA0               = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH3_PA0 */
    PinConfigTIM3_CH3                   = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH3_PA0 */
    PinConfigTIM3_CH3_PA15              = (GPIO_AF_MODE4  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo15 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM3_CH3_PA15 */
    PinConfigTIM14_CH1_PA9              = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo9  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM14_CH1_PA9 */
    PinConfigTIM14_CH1                  = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo9  << 4) + (GPIO_ModuleA << 0),                     /*!< TIM14_CH1_PA9 */
    PinConfigTIM14_CH1_PA11             = (GPIO_AF_MODE3  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo11 << 4) + (GPIO_ModuleA << 0),                     /*!< TIM14_CH1_PA11 */
} PinConfigTIM;

