redstonee/MM32G0001-CMake/Device/MM32G0001/Include/reg_gpio.h
typedef enum {
    PinConfigUART1_RX_PA3               = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo3  << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_RX_PA3 */
    PinConfigUART1_RX                   = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo3  << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_RX_PA3 */
    PinConfigUART1_RX_PA0               = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo0  << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_RX_PA0 */
    PinConfigUART1_RX_PA13              = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo13 << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_RX_PA13 */
    PinConfigUART1_TX_PA12              = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo12 << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_TX_PA12 */
    PinConfigUART1_TX                   = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo12 << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_TX_PA12 */
    PinConfigUART1_TX_PA14              = (GPIO_AF_MODE1  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo14 << 4) + (GPIO_ModuleA << 0),                     /*!< UART1_TX_PA14 */
    PinConfigUART2_RX_PA13              = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo13 << 4) + (GPIO_ModuleA << 0),                     /*!< UART2_RX_PA13 */
    PinConfigUART2_RX                   = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_FLOATING      << 8) + (GPIO_PinNo13 << 4) + (GPIO_ModuleA << 0),                     /*!< UART2_RX_PA13 */
    PinConfigUART2_TX_PA1               = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo1  << 4) + (GPIO_ModuleA << 0),                     /*!< UART2_TX_PA1 */
    PinConfigUART2_TX                   = (GPIO_AF_MODE2  << 12) + (GPIO_CNF_MODE_AF_PP         << 8) + (GPIO_PinNo1  << 4) + (GPIO_ModuleA << 0),                     /*!< UART2_TX_PA1 */
} PinConfigUART;

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/
